{
  "_meta": {
    "lastUpdated": "2026-01-26",
    "version": "1.3",
    "source": "Platform Documentation"
  },
  "category": "platform",
  "title": "Platform Features",
  "description": "Core features and functionality of MetaDJ Nexus platform",
  "entries": [
    {
      "id": "platform-auth",
      "title": "Authentication System",
      "content": "MetaDJ Nexus uses email-based authentication for user accounts. Users sign up with an email, username, and password, accept the Terms & Conditions, then log in to access the full platform experience. The landing page is public and shows platform highlights, while the main app at /app requires authentication. Account settings (desktop user icon) allow users to update email, change password, and sign out. Administrative access is restricted to approved accounts and is not part of the public experience.",
      "keywords": [
        "authentication",
        "login",
        "signup",
        "register",
        "account",
        "password",
        "email"
      ]
    },
    {
      "id": "platform-feedback",
      "title": "Feedback System",
      "content": "Users can submit feedback via the Account panel on desktop or by asking MetaDJai to open the feedback form. The feedback form supports four types of submissions: Bug Reports for issues or errors encountered, Feature Requests for suggesting new functionality, Ideas for general suggestions and creative input, and General Feedback for any other comments. Bug reports include a severity rating from low to critical. All feedback is reviewed by Zuberant to help improve the platform.",
      "keywords": [
        "feedback",
        "bug",
        "report",
        "feature",
        "request",
        "idea",
        "suggestion",
        "issue"
      ]
    },
    {
      "id": "platform-admin",
      "title": "Admin Dashboard",
      "content": "The admin dashboard provides administrators with tools to manage the platform, including reviewing feedback submissions, viewing usage analytics, and managing user accounts. Admin access is restricted to approved accounts and is not part of the public experience.",
      "keywords": [
        "admin",
        "dashboard",
        "management",
        "analytics",
        "statistics"
      ]
    },
    {
      "id": "platform-views",
      "title": "Platform Views",
      "content": "MetaDJ Nexus offers four main sections: Hub is the home base for browsing music collections and featured content. Cinema provides an immersive visual experience with collection artwork and ambient visuals synced to music playback. Wisdom offers curated knowledge, guides, reflections, and creative philosophy. Journal is a private space for personal ideas and reflections. Users can switch between sections using the navigation in the header.",
      "keywords": [
        "views",
        "hub",
        "cinema",
        "wisdom",
        "journal",
        "navigation"
      ]
    },
    {
      "id": "platform-metadjai",
      "title": "MetaDJai AI Companion",
      "content": "MetaDJai is the AI companion built into MetaDJ Nexus. MetaDJai helps users explore music collections, get recommendations based on mood or genre, learn about the MetaDJ philosophy and ecosystem, navigate platform features, and submit feedback about the platform. Chat history is saved to your account when you're signed in. Users can open MetaDJai by clicking the MetaDJai button in the header or using the chat bubble on mobile.",
      "keywords": [
        "metadjai",
        "ai",
        "companion",
        "chat",
        "help",
        "recommendations"
      ]
    }
  ]
}
